pip install pandas

In [10]:
import pandas as pd

df = pd.read_excel (r'IMDB Movie Ratings (1).xlsx')
print (df)

In [16]:
#displayinf last five rows of dataset
df.tail()

     Movie Rank            Movie Name  Year of Release  IMDB Rating
245         246               Aladdin             1992          8.0
246         247                Gandhi             1982          8.0
247         248              Jai Bhim             2021          8.0
248         249              The Help             2011          8.0
249         250  Beauty and the Beast             1991          8.0

In [20]:
#This function provides the boolean value for the complete dataset to know if any null value is present or not.
df.isnull()

     Movie Rank  Movie Name  Year of Release  IMDB Rating
0         False       False            False        False
1         False       False            False        False
2         False       False            False        False
3         False       False            False        False
4         False       False            False        False
..          ...         ...              ...          ...
245       False       False            False        False
246       False       False            False        False
247       False       False            False        False
248       False       False            False        False
249       False       False            False        False

[250 rows x 4 columns]

In [21]:
#same as the isnull() function
df.isna()

     Movie Rank  Movie Name  Year of Release  IMDB Rating
0         False       False            False        False
1         False       False            False        False
2         False       False            False        False
3         False       False            False        False
4         False       False            False        False
..          ...         ...              ...          ...
245       False       False            False        False
246       False       False            False        False
247       False       False            False        False
248       False       False            False        False
249       False       False            False        False

[250 rows x 4 columns]

In [22]:
#This function also gives a boolean value if any null value is present or not, but it gives results column-wise, not in tabular format.
df.isna().any()

Movie Rank         False
Movie Name         False
Year of Release    False
IMDB Rating        False
dtype: bool

In [23]:
#This function gives the sum of the null values preset in the dataset column-wise.
df.isna().sum()

Movie Rank         0
Movie Name         0
Year of Release    0
IMDB Rating        0
dtype: int64

In [24]:
#This function gives output in a single value if any null is present or not.
df.isna().any().sum()

0

In [25]:
#this function is used to see that dataset doesn’t contain any duplicate values.
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
245    False
246    False
247    False
248    False
249    False
Length: 250, dtype: bool